Revit 2026 API

# UVGridlineType Enumeration

---

A choice between U-gridlines or V-gridlines of a divided surface U Gridlines V Gridlines

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum UVGridlineType
```
```vb
Public Enumeration UVGridlineType
```
```cpp
public enum class UVGridlineType
```
```fsharp
type UVGridlineType
```

| Member name | Value | Description |
| --- | --- | --- |
| U | 0 |  |
| V | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace